[
   {
    "title": "TURFY x WPS Ramadan Weekend Nights",
    "image": "https://ykxbwoyiyhijpahjdjlz.supabase.co/storage/v1/object/sign/news-images/Turfyxwps.jpeg?token=eyJraWQiOiJzdG9yYWdlLXVybC1zaWduaW5nLWtleV8yNzc4YmJkMS1mYzNmLTRmMzYtOTBmNy1jOWJjMzVjZjAzNjUiLCJhbGciOiJIUzI1NiJ9.eyJ1cmwiOiJuZXdzLWltYWdlcy9UdXJmeXh3cHMuanBlZyIsImlhdCI6MTc3MDQ2Njc4NiwiZXhwIjoxODAyMDAyNzg2fQ.Ix7mWiEi4vDMgkDIP224om6ID1Nhpbz7P_Vfo2RGWgY",
    "short": "TURFY partners with WPS to host Ramadan Weekend Nights on the app.
Register your team. Track every match live.",
    "content": "Turfy proudly collaborates with White Paper Sports to bring Ramadan Weekend Nights 2026 to the app. This official partnership means the entire tournament will run digitally on Turfy, with registrations, fixtures, standings, and match stats managed in one place. Teams will compete on 6, 7, 8 March and 13, 14, 15 March 2026 at Sport On Clifton in a 5 aside format with 9 player squads, 4 groups, and a minimum of 5 league matches per team. Every goal, card, and result will be recorded live, giving players and fans a complete and transparent tournament experience throughout Ramadan.",
    "date": "2026-02-08"
  },
  {
    "title": "Playturfy Championship 2025 Kicks Off This Weekend",
    "image": "https://images.unsplash.com/photo-1579952363873-27f3bade9f55?w=1200&h=600&fit=crop",
    "short": "The most anticipated football tournament of the year begins this Saturday with 32 teams competing for the championship trophy.",
    "content": "The turfy Championship 2025 officially kicks off this weekend with an exciting lineup of matches featuring 32 elite teams from across the region. The tournament, which runs through December, promises to deliver thrilling football action and showcase some of the best talent in the sport.\n\nThe opening ceremony will take place at the National Stadium on Saturday at 3 PM, followed by the first match between defending champions Team Alpha and challengers Team Beta. Both teams have been training intensively and are ready to put on a spectacular show for fans.\n\nThis year's tournament features several new innovations, including live match tracking through the Playturfy app, real-time statistics, and instant match summary cards that fans can share on social media. Tournament organizers have also introduced a new knockout format that promises more competitive matches.\n\nFans can follow all the action through the Playturfy app, which provides live scores, player statistics, and tournament standings. Download the app today to stay updated with every goal, card, and substitution throughout the championship.",
    "date": "2025-11-19"
  },
  
  {
    "title": "Player Spotlight: Sarah Johnson Named Player of the Month",
    "image": "https://images.unsplash.com/photo-1522778119026-d647f0596c20?w=1200&h=600&fit=crop",
    "short": "Sarah Johnson's exceptional performance with 10 goals and 5 assists earns her the prestigious Player of the Month award.",
    "content": "Congratulations to Sarah Johnson for being named Playturfy Player of the Month for November! Sarah's outstanding performance has made her a standout player in the league.\n\nNovember Statistics:\n• 10 Goals scored across 6 matches\n• 5 Assists to teammates\n• 94% Pass accuracy\n• 3 Match-winning performances\n• Zero disciplinary cards\n\nSarah's most memorable moment came during last week's derby match where she scored a stunning hat-trick, including a last-minute winner that secured a crucial 4-3 victory for her team. Her ability to perform under pressure and deliver when it matters most has made her an invaluable asset to her squad.\n\nIn an exclusive interview, Sarah shared her thoughts: 'I'm incredibly honored to receive this award. Football is a team sport, and I couldn't have achieved this without the support of my amazing teammates, coaches, and fans. Every goal I score is a result of our collective effort and dedication.'\n\nSarah's coach praised her work ethic: 'Sarah is not just a talented player; she's a leader on and off the field. Her commitment to training, positive attitude, and willingness to help younger players develop makes her a role model for everyone in our club.'\n\nThe Player of the Month award is determined by a combination of statistics tracked through the Playturfy app, coach nominations, and fan votes. Sarah will receive a trophy and a feature in our monthly newsletter.\n\nCongratulations again, Sarah! Keep up the excellent work!",
    "date": "2025-11-15"
  },
  {
    "title": "How to Create the Perfect Match Summary Card",
    "image": "https://images.unsplash.com/photo-1574629810360-7efbbe195018?w=1200&h=600&fit=crop",
    "short": "Learn how to use Playturfy's match summary card feature to create professional-looking graphics for social media.",
    "content": "One of Playturfy's most popular features is the ability to generate beautiful match summary cards that you can share on social media. Here's a complete guide to creating the perfect match card.\n\nStep 1: Complete Your Match\nFirst, make sure you've recorded all match events including goals, assists, cards, and substitutions. The more complete your match data, the better your summary card will look.\n\nStep 2: Access the Summary Card Feature\nAfter finishing a match, tap the 'Create Summary Card' button on the match results screen. This will open the card designer.\n\nStep 3: Choose Your Template\nPlayturfy offers several professional templates:\n• Classic: Clean and simple design\n• Modern: Bold colors and dynamic layout\n• Minimal: Elegant and understated\n• Championship: Premium look for important matches\n\nStep 4: Customize Your Card\nPersonalize your card by:\n• Adding team logos (upload custom or choose from our library)\n• Selecting your preferred color scheme\n• Including player photos\n• Adding match highlights and key statistics\n• Choosing which stats to display\n\nStep 5: Preview and Adjust\nReview your card and make any final adjustments. You can change fonts, colors, and layout until it's perfect.\n\nStep 6: Download and Share\nOnce you're happy with your card, tap 'Download' to save it to your device. Then share it directly to Facebook, Instagram, Twitter, or WhatsApp.\n\nPro Tips:\n• Use high-quality team logos for the best results\n• Include key match statistics like possession and shots\n• Add a caption with match highlights when sharing\n• Create cards immediately after matches while the excitement is fresh\n• Use consistent branding for your team's cards\n\nMatch summary cards are a great way to celebrate victories, document your team's journey, and engage with fans on social media. Start creating yours today!",
    "date": "2025-11-12"
  },
  
  {
    "title": "Understanding Football Statistics: A Beginner's Guide",
    "image": "https://images.unsplash.com/photo-1431324155629-1a6deb1dec8d?w=1200&h=600&fit=crop",
    "short": "New to football stats? Learn what all those numbers mean and how to use them to improve your game.",
    "content": "Football statistics can seem overwhelming at first, but understanding them helps you analyze performance and improve your game. Here's a beginner-friendly guide to the most important stats.\n\nBasic Match Statistics:\n\nGoals: The most important stat! The number of times a player or team scores.\n\nAssists: When a player makes the final pass that leads directly to a goal. Shows playmaking ability.\n\nShots: Total attempts at goal. Includes shots on target, off target, and blocked.\n\nShots on Target: Shots that would have gone in if not saved by the goalkeeper. Indicates accuracy.\n\nPossession: Percentage of time a team controls the ball. Higher possession often means more control of the game.\n\nPasses: Number of successful passes completed. Shows team coordination.\n\nPass Accuracy: Percentage of passes that reach a teammate. Elite players often have 85%+ accuracy.\n\nTackles: Defensive actions to win the ball from opponents. Shows defensive contribution.\n\nInterceptions: When a player reads the game and cuts out an opponent's pass.\n\nAdvanced Statistics:\n\nExpected Goals (xG): Measures the quality of scoring chances. An xG of 2.5 means a team should have scored 2-5 goals based on their chances.\n\nKey Passes: Passes that lead to a shot. Shows creative ability.\n\nDribbles Completed: Successful attempts to beat an opponent with the ball.\n\nAerial Duels Won: Success rate in heading contests.\n\nClean Sheets: Matches where a goalkeeper/defense doesn't concede a goal.\n\nHow Playturfy Tracks Stats:\n\nThe Playturfy app automatically calculates these statistics as you record match events:\n• Tap to record goals, assists, and cards\n• Track substitutions and playing time\n• View real-time statistics during matches\n• Generate detailed post-match reports\n• Compare player and team performance over time\n\nUsing Stats to Improve:\n\n1. Identify Strengths: See what you're doing well and build on it\n2. Find Weaknesses: Spot areas that need improvement\n3. Set Goals: Use stats to create measurable objectives\n4. Track Progress: Monitor improvement over weeks and months\n5. Make Tactical Decisions: Use data to inform team strategy\n\nRemember: Statistics tell part of the story, but they don't capture everything. Leadership, teamwork, and mental strength are equally important and harder to measure.\n\nStart tracking your matches with Playturfy today and discover insights that will help you become a better player!",
    "date": "2025-11-08"
  },
  {
    "title": "Understanding Football Statistics: A Beginner's Guide",
    "image": "https://images.unsplash.com/photo-1431324155629-1a6deb1dec8d?w=1200&h=600&fit=crop",
    "short": "New to football stats? Learn what all those numbers mean and how to use them to improve your game.",
    "content": "Football statistics can seem overwhelming at first, but understanding them helps you analyze performance and improve your game. Here's a beginner-friendly guide to the most important stats.\n\nBasic Match Statistics:\n\nGoals: The most important stat! The number of times a player or team scores.\n\nAssists: When a player makes the final pass that leads directly to a goal. Shows playmaking ability.\n\nShots: Total attempts at goal. Includes shots on target, off target, and blocked.\n\nShots on Target: Shots that would have gone in if not saved by the goalkeeper. Indicates accuracy.\n\nPossession: Percentage of time a team controls the ball. Higher possession often means more control of the game.\n\nPasses: Number of successful passes completed. Shows team coordination.\n\nPass Accuracy: Percentage of passes that reach a teammate. Elite players often have 85%+ accuracy.\n\nTackles: Defensive actions to win the ball from opponents. Shows defensive contribution.\n\nInterceptions: When a player reads the game and cuts out an opponent's pass.\n\nAdvanced Statistics:\n\nExpected Goals (xG): Measures the quality of scoring chances. An xG of 2.5 means a team should have scored 2-5 goals based on their chances.\n\nKey Passes: Passes that lead to a shot. Shows creative ability.\n\nDribbles Completed: Successful attempts to beat an opponent with the ball.\n\nAerial Duels Won: Success rate in heading contests.\n\nClean Sheets: Matches where a goalkeeper/defense doesn't concede a goal.\n\nHow Playturfy Tracks Stats:\n\nThe Playturfy app automatically calculates these statistics as you record match events:\n• Tap to record goals, assists, and cards\n• Track substitutions and playing time\n• View real-time statistics during matches\n• Generate detailed post-match reports\n• Compare player and team performance over time\n\nUsing Stats to Improve:\n\n1. Identify Strengths: See what you're doing well and build on it\n2. Find Weaknesses: Spot areas that need improvement\n3. Set Goals: Use stats to create measurable objectives\n4. Track Progress: Monitor improvement over weeks and months\n5. Make Tactical Decisions: Use data to inform team strategy\n\nRemember: Statistics tell part of the story, but they don't capture everything. Leadership, teamwork, and mental strength are equally important and harder to measure.\n\nStart tracking your matches with Playturfy today and discover insights that will help you become a better player!",
    "date": "2025-11-08"
  }

]
